In [8]:
import pandas as pd

### Poblacion (population_limpio)

In [13]:
poblacion = pd.read_csv('bronze/Population_limpio.csv')

In [14]:
poblacion.head()

        State  Total population Categoría de densidad
0     Alabama           5039877               Mediana
1      Alaska            732673                  Baja
2     Arizona           7276316                  Alta
3    Arkansas           3025891               Mediana
4  California          39237836                  Alta

In [15]:
poblacion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   State                  52 non-null     object
 1   Total population       52 non-null     int64
 2   Categoría de densidad  52 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

In [16]:
# Agregar una columna "id" autoincremental
poblacion['Id_Estado'] = range(1, len(poblacion) + 1)

In [17]:
# Cambiar nombres
poblacion.rename(columns={'State' : 'Nombre_Estado', 'Total population' : 'Total_Poblacion', 'Categoría de densidad' : 'Categoria_Densidad'},inplace=True)
poblacion.head()

  Nombre_Estado  Total_Poblacion Categoria_Densidad  Id_Estado
0       Alabama          5039877            Mediana          1
1        Alaska           732673               Baja          2
2       Arizona          7276316               Alta          3
3      Arkansas          3025891            Mediana          4
4    California         39237836               Alta          5

In [18]:
#cantidad de estados
poblacion.Nombre_Estado.nunique()

52

In [19]:
# Obtener los valores únicos de los estado
poblacion['Nombre_Estado'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming', 'Puerto Rico'],
      dtype=object)

In [20]:
# Eliminar registros donde "nombre_estado" sea igual a "Puerto Rico"
poblacion = poblacion[poblacion['Nombre_Estado'] != 'Puerto Rico']

In [21]:
poblacion.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51 entries, 0 to 50
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nombre_Estado       51 non-null     object
 1   Total_Poblacion     51 non-null     int64
 2   Categoria_Densidad  51 non-null     object
 3   Id_Estado           51 non-null     int64
dtypes: int64(2), object(2)
memory usage: 2.0+ KB

In [22]:
#reorganizar las columnas 
poblacion = poblacion[['Id_Estado', 'Nombre_Estado', 'Total_Poblacion', 'Categoria_Densidad']]
#reinicio los indices
poblacion.reset_index(drop=True).head()

   Id_Estado Nombre_Estado  Total_Poblacion Categoria_Densidad
0          1       Alabama          5039877            Mediana
1          2        Alaska           732673               Baja
2          3       Arizona          7276316               Alta
3          4      Arkansas          3025891            Mediana
4          5    California         39237836               Alta

In [23]:
#guardo Estados
poblacion.to_csv('silver/Estados.csv',index=False)

### inversion_franquicias

In [11]:
franquicias = pd.read_csv('bronze/inversion_franquicias.csv')

In [12]:
franquicias.head()

                   Title  Investment min  Investment MAX  Founding Year  Units
0                 Subway        190000.0        522000.0           1967  20576
1             McDonald's        521000.0       2500000.0           1955  13455
2                Dunkin'        121000.0       1810000.0           1954   8118
3  Taco Bell Traditional        576000.0       3370000.0           1962   7513
4            Burger King        232000.0       4520000.0           1954   7043

In [91]:
franquicias.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Title           999 non-null    object
 1   Investment min  999 non-null    float64
 2   Investment MAX  999 non-null    float64
 3   Founding Year   999 non-null    int64
 4   Units           999 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 39.1+ KB

In [92]:
#cantidad de franquicias unicas
franquicias.Title.nunique()

939

In [93]:
#cantidad de duplicados
franquicias.duplicated().sum()

60

In [94]:
#elimina duplicados 
franquicias.drop_duplicates(inplace=True)

In [95]:
# Agregar una columna "id" autoincremental
franquicias['Id_Franquicia'] = range(1, len(franquicias) + 1)

In [96]:
franquicias.columns

Index(['Title', 'Investment min', 'Investment MAX', 'Founding Year', 'Units',
       'Id_Franquicia'],
      dtype='object')

In [97]:
# Cambiar nombres
franquicias.rename(columns={'Title' : 'Nombre_Franquicia','Investment min' : 'Min_Inversion', 'Investment MAX' : 'Max_Inversion', 'Founding Year' : 'Año_Fundado','Units' : 'Unidades' },inplace=True)
franquicias.head()

,Nombre_Franquicia,Min_Inversion,Max_Inversion,Año_Fundado,Unidades,Id_Franquicia
0,Subway,190000.0,522000.0,1967,20576,1
1,McDonald's,521000.0,2500000.0,1955,13455,2
2,Dunkin',121000.0,1810000.0,1954,8118,3
3,Taco Bell Traditional,576000.0,3370000.0,1962,7513,4
4,Burger King,232000.0,4520000.0,1954,7043,5

In [98]:
#reorganizar las columnas 
franquicias = franquicias[['Id_Franquicia', 'Nombre_Franquicia', 'Min_Inversion', 'Max_Inversion', 'Año_Fundado','Unidades']]
#reinicio los indices
franquicias.reset_index(drop=True).head()

,Id_Franquicia,Nombre_Franquicia,Min_Inversion,Max_Inversion,Año_Fundado,Unidades
0,1,Subway,190000.0,522000.0,1967,20576
1,2,McDonald's,521000.0,2500000.0,1955,13455
2,3,Dunkin',121000.0,1810000.0,1954,8118
3,4,Taco Bell Traditional,576000.0,3370000.0,1962,7513
4,5,Burger King,232000.0,4520000.0,1954,7043

In [100]:
franquicias.to_csv('silver/Franquicias_Inversion.csv',index=False)

### Google (Datos_procesados)

In [166]:
#cargo el archivo
google = pd.read_csv('bronze/google.csv')

In [167]:
#observo las 5 primeras filas
google.head()

,Unnamed: 0,latitude,longitude,category,name,Estado,avg_rating,num_of_reviews
0,12,33.381416,-86.807040,Pizza restaurant,California Pizza Kitchen at Riverchase Galleria,Alabama,4.1,18
1,14,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",Pizza Hut,Alabama,3.2,78
2,18,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",Cheetos,Alabama,4.0,26
3,84,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",Taco Bell,Alabama,3.0,17
4,122,34.681722,-85.681300,American restaurant,Doris Jean's Country Kitchen,Alabama,4.1,48

In [168]:
#observo la info del dataset
google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95059 entries, 0 to 95058
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      95059 non-null  int64
 1   latitude        95059 non-null  float64
 2   longitude       95059 non-null  float64
 3   category        95059 non-null  object
 4   name            95059 non-null  object
 5   Estado          95059 non-null  object
 6   avg_rating      95059 non-null  float64
 7   num_of_reviews  95059 non-null  int64
dtypes: float64(3), int64(2), object(3)
memory usage: 5.8+ MB

In [169]:
#elimino columna
google.drop(columns=['Unnamed: 0'], inplace = True)

In [170]:
#observo las columnas
google.columns

Index(['latitude', 'longitude', 'category', 'name', 'Estado', 'avg_rating',
       'num_of_reviews'],
      dtype='object')

In [171]:
# cantidad de duplicados
google.duplicated().sum()

0

In [172]:
google.head()

,latitude,longitude,category,name,Estado,avg_rating,num_of_reviews
0,33.381416,-86.807040,Pizza restaurant,California Pizza Kitchen at Riverchase Galleria,Alabama,4.1,18
1,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",Pizza Hut,Alabama,3.2,78
2,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",Cheetos,Alabama,4.0,26
3,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",Taco Bell,Alabama,3.0,17
4,34.681722,-85.681300,American restaurant,Doris Jean's Country Kitchen,Alabama,4.1,48

In [173]:
# Cambiar nombres
google.rename(columns={'latitude' : 'Latitud', 'longitude' : 'Longitud', 'category' : 'Categoria', 'name' : 'Nombre_Franquicia', 'Estado' : 'Nombre_Estado', 'avg_rating' : 'Promedio_Rating', 'num_of_reviews' : 'Cantidad_Reviews'},
              inplace=True)
google.head()

,Latitud,Longitud,Categoria,Nombre_Franquicia,Nombre_Estado,Promedio_Rating,Cantidad_Reviews
0,33.381416,-86.807040,Pizza restaurant,California Pizza Kitchen at Riverchase Galleria,Alabama,4.1,18
1,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",Pizza Hut,Alabama,3.2,78
2,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",Cheetos,Alabama,4.0,26
3,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",Taco Bell,Alabama,3.0,17
4,34.681722,-85.681300,American restaurant,Doris Jean's Country Kitchen,Alabama,4.1,48

In [174]:
# cargo estados
Estados = pd.read_csv('silver/Estados.csv')

In [175]:
Estados.head(2)

   Id_Estado Nombre_Estado  Total_Poblacion Categoria_Densidad
0          1       Alabama          5039877            Mediana
1          2        Alaska           732673               Baja

In [176]:
Estados.Nombre_Estado.nunique()

51

In [177]:
# del dataset estado muestro los nombre_estado
Estados.Nombre_Estado.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [178]:
google.Nombre_Estado.nunique()

48

In [179]:
google.Nombre_Estado.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District_of_Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New_Hampshire',
       'New_Jersey', 'New_Mexico', 'New_York', 'North_Carolina',
       'North_Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode_Island', 'South_Carolina', 'South_Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington'], dtype=object)

In [180]:
# Reemplazar guiones bajos por espacios en la columna "Nombre_Estado"
google['Nombre_Estado'] = google['Nombre_Estado'].str.replace('_', ' ')

In [181]:
google.Nombre_Estado.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington'], dtype=object)

In [182]:
# creo una columna nueva id_estado relacionada con el dataset estado
google = google.merge(Estados[['Id_Estado', 'Nombre_Estado']], on='Nombre_Estado', how='left')
google.head()

,Latitud,Longitud,Categoria,Nombre_Franquicia,Nombre_Estado,Promedio_Rating,Cantidad_Reviews,Id_Estado
0,33.381416,-86.807040,Pizza restaurant,California Pizza Kitchen at Riverchase Galleria,Alabama,4.1,18,1
1,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",Pizza Hut,Alabama,3.2,78,1
2,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",Cheetos,Alabama,4.0,26,1
3,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",Taco Bell,Alabama,3.0,17,1
4,34.681722,-85.681300,American restaurant,Doris Jean's Country Kitchen,Alabama,4.1,48,1

In [183]:
# Agregar una columna "id" autoincremental
google['Id_Local'] = range(1, len(google) + 1)

In [184]:
google.head()

,Latitud,Longitud,Categoria,Nombre_Franquicia,Nombre_Estado,Promedio_Rating,Cantidad_Reviews,Id_Estado,Id_Local
0,33.381416,-86.807040,Pizza restaurant,California Pizza Kitchen at Riverchase Galleria,Alabama,4.1,18,1,1
1,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",Pizza Hut,Alabama,3.2,78,1,2
2,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",Cheetos,Alabama,4.0,26,1,3
3,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",Taco Bell,Alabama,3.0,17,1,4
4,34.681722,-85.681300,American restaurant,Doris Jean's Country Kitchen,Alabama,4.1,48,1,5

In [185]:
#reorganizar las columnas 
google = google[['Id_Local', 'Nombre_Franquicia', 'Latitud', 'Longitud', 'Categoria','Promedio_Rating','Cantidad_Reviews','Id_Estado', 'Nombre_Estado']]
#reinicio los indices
google.reset_index(drop=True).head()

,Id_Local,Nombre_Franquicia,Latitud,Longitud,Categoria,Promedio_Rating,Cantidad_Reviews,Id_Estado,Nombre_Estado
0,1,California Pizza Kitchen at Riverchase Galleria,33.381416,-86.807040,Pizza restaurant,4.1,18,1,Alabama
1,2,Pizza Hut,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",3.2,78,1,Alabama
2,3,Cheetos,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",4.0,26,1,Alabama
3,4,Taco Bell,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",3.0,17,1,Alabama
4,5,Doris Jean's Country Kitchen,34.681722,-85.681300,American restaurant,4.1,48,1,Alabama

In [186]:
google.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 95059 entries, 0 to 95058
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id_Local           95059 non-null  int64
 1   Nombre_Franquicia  95059 non-null  object
 2   Latitud            95059 non-null  float64
 3   Longitud           95059 non-null  float64
 4   Categoria          95059 non-null  object
 5   Promedio_Rating    95059 non-null  float64
 6   Cantidad_Reviews   95059 non-null  int64
 7   Id_Estado          95059 non-null  int64
 8   Nombre_Estado      95059 non-null  object
dtypes: float64(3), int64(3), object(3)
memory usage: 7.3+ MB

In [187]:
#guardo Estados
google.to_csv('silver/Google_Final.csv',index=False)

### Yelp

In [188]:
yelp = pd.read_csv('bronze/Yelp.csv')

In [189]:
yelp.head()

,Unnamed: 0,text,latitude,longitude
0,0,Avengers time with the ladies.,32.224841,-110.916351
1,1,The Dark Knight Rises in XD! I don't know what...,32.224841,-110.916351
2,2,Cleanliness matters....I just sat down to watc...,32.224841,-110.916351
3,3,Early bird gets the worm!,32.224841,-110.916351
4,4,Brand new seats!,32.224841,-110.916351

In [190]:
yelp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 908915 entries, 0 to 908914
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  908915 non-null  int64
 1   text        908910 non-null  object
 2   latitude    908915 non-null  float64
 3   longitude   908915 non-null  float64
dtypes: float64(2), int64(1), object(1)
memory usage: 27.7+ MB

In [191]:
#elimino columna
yelp.drop(columns=['Unnamed: 0'], inplace = True)

In [192]:
#observo las columnas
yelp.columns

Index(['text', 'latitude', 'longitude'], dtype='object')

In [193]:
#borra la fila con valores faltantes
yelp.dropna(inplace = True)

In [194]:
yelp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 908910 entries, 0 to 908914
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   text       908910 non-null  object
 1   latitude   908910 non-null  float64
 2   longitude  908910 non-null  float64
dtypes: float64(2), object(1)
memory usage: 27.7+ MB

In [195]:
# Cambiar nombres
yelp.rename(columns={'text' : 'Comentario','latitude' : 'Latitud', 'longitude' : 'Longitud'},inplace=True)
yelp.head()

                                          Comentario    Latitud    Longitud
0                     Avengers time with the ladies.  32.224841 -110.916351
1  The Dark Knight Rises in XD! I don't know what...  32.224841 -110.916351
2  Cleanliness matters....I just sat down to watc...  32.224841 -110.916351
3                          Early bird gets the worm!  32.224841 -110.916351
4                                   Brand new seats!  32.224841 -110.916351

In [196]:
#reorganizar las columnas 
yelp = yelp[['Latitud', 'Longitud', 'Comentario']]
#reinicio los indices
yelp.reset_index(drop=True).head()

     Latitud    Longitud                                         Comentario
0  32.224841 -110.916351                     Avengers time with the ladies.
1  32.224841 -110.916351  The Dark Knight Rises in XD! I don't know what...
2  32.224841 -110.916351  Cleanliness matters....I just sat down to watc...
3  32.224841 -110.916351                          Early bird gets the worm!
4  32.224841 -110.916351                                   Brand new seats!

In [197]:
yelp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 908910 entries, 0 to 908914
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Latitud     908910 non-null  float64
 1   Longitud    908910 non-null  float64
 2   Comentario  908910 non-null  object
dtypes: float64(2), object(1)
memory usage: 27.7+ MB

In [198]:
# cantidad de duplicados
yelp.duplicated().sum()

3141

In [199]:
#elimina duplicados 
yelp.drop_duplicates(inplace=True)

In [200]:
# cantidad de duplicados
yelp.duplicated().sum()

0

In [201]:
#guardo dataset resultante
yelp.to_csv('silver/Yelp_Final.csv',index=False)

### Reviews (Dataset_final)

In [202]:
Google_Final = pd.read_csv('silver/Google_Final.csv')

In [203]:
Google_Final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95059 entries, 0 to 95058
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id_Local           95059 non-null  int64
 1   Nombre_Franquicia  95059 non-null  object
 2   Latitud            95059 non-null  float64
 3   Longitud           95059 non-null  float64
 4   Categoria          95059 non-null  object
 5   Promedio_Rating    95059 non-null  float64
 6   Cantidad_Reviews   95059 non-null  int64
 7   Id_Estado          95059 non-null  int64
 8   Nombre_Estado      95059 non-null  object
dtypes: float64(3), int64(3), object(3)
memory usage: 6.5+ MB

In [204]:
Google_Final.head()

,Id_Local,Nombre_Franquicia,Latitud,Longitud,Categoria,Promedio_Rating,Cantidad_Reviews,Id_Estado,Nombre_Estado
0,1,California Pizza Kitchen at Riverchase Galleria,33.381416,-86.807040,Pizza restaurant,4.1,18,1,Alabama
1,2,Pizza Hut,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",3.2,78,1,Alabama
2,3,Cheetos,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",4.0,26,1,Alabama
3,4,Taco Bell,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",3.0,17,1,Alabama
4,5,Doris Jean's Country Kitchen,34.681722,-85.681300,American restaurant,4.1,48,1,Alabama

In [205]:
Yelp_Final = pd.read_csv('silver/Yelp_Final.csv')

In [206]:
Yelp_Final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 905769 entries, 0 to 905768
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Latitud     905769 non-null  float64
 1   Longitud    905769 non-null  float64
 2   Comentario  905769 non-null  object
dtypes: float64(2), object(1)
memory usage: 20.7+ MB

In [207]:
Yelp_Final.head()

     Latitud    Longitud                                         Comentario
0  32.224841 -110.916351                     Avengers time with the ladies.
1  32.224841 -110.916351  The Dark Knight Rises in XD! I don't know what...
2  32.224841 -110.916351  Cleanliness matters....I just sat down to watc...
3  32.224841 -110.916351                          Early bird gets the worm!
4  32.224841 -110.916351                                   Brand new seats!

In [217]:
# unir los dos dataframe
Reviews = Google_Final.merge(Yelp_Final, on=["Latitud","Longitud"], how='left')

In [218]:
Reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 103029 entries, 0 to 103028
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Id_Local           103029 non-null  int64
 1   Nombre_Franquicia  103029 non-null  object
 2   Latitud            103029 non-null  float64
 3   Longitud           103029 non-null  float64
 4   Categoria          103029 non-null  object
 5   Promedio_Rating    103029 non-null  float64
 6   Cantidad_Reviews   103029 non-null  int64
 7   Id_Estado          103029 non-null  int64
 8   Nombre_Estado      103029 non-null  object
 9   Comentario         8592 non-null    object
dtypes: float64(3), int64(3), object(4)
memory usage: 8.6+ MB

In [219]:
# Cambiar nombres
Reviews.rename(columns={'Id_Local' : 'Id_Reviews'},inplace=True)
Reviews.head()

,Id_Reviews,Nombre_Franquicia,Latitud,Longitud,Categoria,Promedio_Rating,Cantidad_Reviews,Id_Estado,Nombre_Estado,Comentario
0,1,California Pizza Kitchen at Riverchase Galleria,33.381416,-86.807040,Pizza restaurant,4.1,18,1,Alabama,NaN
1,2,Pizza Hut,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",3.2,78,1,Alabama,NaN
2,3,Cheetos,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",4.0,26,1,Alabama,NaN
3,4,Taco Bell,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",3.0,17,1,Alabama,NaN
4,5,Doris Jean's Country Kitchen,34.681722,-85.681300,American restaurant,4.1,48,1,Alabama,NaN

In [220]:
#cantidad de duplicados
Reviews.duplicated().sum()

0

In [221]:
#cambiar na por sin comentario
Reviews['Comentario'].fillna('sin comentario', inplace=True)

In [222]:
#reorganizar las columnas 
Reviews = Reviews[['Id_Reviews', 'Nombre_Franquicia', 'Latitud', 'Longitud', 'Categoria','Promedio_Rating','Cantidad_Reviews', 'Comentario', 'Id_Estado', 'Nombre_Estado']]
#reinicio los indices
Reviews.reset_index(drop=True).head()

,Id_Reviews,Nombre_Franquicia,Latitud,Longitud,Categoria,Promedio_Rating,Cantidad_Reviews,Comentario,Id_Estado,Nombre_Estado
0,1,California Pizza Kitchen at Riverchase Galleria,33.381416,-86.807040,Pizza restaurant,4.1,18,sin comentario,1,Alabama
1,2,Pizza Hut,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",3.2,78,sin comentario,1,Alabama
2,3,Cheetos,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",4.0,26,sin comentario,1,Alabama
3,4,Taco Bell,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",3.0,17,sin comentario,1,Alabama
4,5,Doris Jean's Country Kitchen,34.681722,-85.681300,American restaurant,4.1,48,sin comentario,1,Alabama

In [223]:
Reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 103029 entries, 0 to 103028
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Id_Reviews         103029 non-null  int64
 1   Nombre_Franquicia  103029 non-null  object
 2   Latitud            103029 non-null  float64
 3   Longitud           103029 non-null  float64
 4   Categoria          103029 non-null  object
 5   Promedio_Rating    103029 non-null  float64
 6   Cantidad_Reviews   103029 non-null  int64
 7   Comentario         103029 non-null  object
 8   Id_Estado          103029 non-null  int64
 9   Nombre_Estado      103029 non-null  object
dtypes: float64(3), int64(3), object(4)
memory usage: 8.6+ MB

In [224]:
#cargo franquicias
franquicias = pd.read_csv('silver/Franquicias_Inversion.csv')
franquicias.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 939 entries, 0 to 938
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id_Franquicia      939 non-null    int64
 1   Nombre_Franquicia  939 non-null    object
 2   Min_Inversion      939 non-null    float64
 3   Max_Inversion      939 non-null    float64
 4   Año_Fundado        939 non-null    int64
 5   Unidades           939 non-null    int64
dtypes: float64(2), int64(3), object(1)
memory usage: 44.1+ KB

In [225]:
# creo una columna nueva id_estado relacionada con el dataset estado
Reviews = Reviews.merge(franquicias[['Id_Franquicia', 'Nombre_Franquicia']], on='Nombre_Franquicia', how='left')
Reviews.head()

,Id_Reviews,Nombre_Franquicia,Latitud,Longitud,Categoria,Promedio_Rating,Cantidad_Reviews,Comentario,Id_Estado,Nombre_Estado,Id_Franquicia
0,1,California Pizza Kitchen at Riverchase Galleria,33.381416,-86.807040,Pizza restaurant,4.1,18,sin comentario,1,Alabama,NaN
1,2,Pizza Hut,33.100547,-86.861968,"Pizza delivery, Chicken wings restaurant, Pizz...",3.2,78,sin comentario,1,Alabama,NaN
2,3,Cheetos,32.631013,-85.437473,"Asian fusion restaurant, Dessert restaurant",4.0,26,sin comentario,1,Alabama,NaN
3,4,Taco Bell,34.843859,-86.711656,"Fast food restaurant, Breakfast restaurant, Bu...",3.0,17,sin comentario,1,Alabama,NaN
4,5,Doris Jean's Country Kitchen,34.681722,-85.681300,American restaurant,4.1,48,sin comentario,1,Alabama,NaN

In [226]:
Reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 103029 entries, 0 to 103028
Data columns (total 11 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Id_Reviews         103029 non-null  int64
 1   Nombre_Franquicia  103029 non-null  object
 2   Latitud            103029 non-null  float64
 3   Longitud           103029 non-null  float64
 4   Categoria          103029 non-null  object
 5   Promedio_Rating    103029 non-null  float64
 6   Cantidad_Reviews   103029 non-null  int64
 7   Comentario         103029 non-null  object
 8   Id_Estado          103029 non-null  int64
 9   Nombre_Estado      103029 non-null  object
 10  Id_Franquicia      15652 non-null   float64
dtypes: float64(4), int64(3), object(4)
memory usage: 9.4+ MB

In [227]:
Reviews.to_csv('silver/Reviews_Completo.csv',index=False)

### capa gold (dividir dataframe)

In [1]:
import pandas as pd

#### Review

In [228]:
# 'reviews_completo'
Reviews_Completo = pd.read_csv('silver/Reviews_Completo.csv')

In [238]:
# Obtén la longitud total del DataFrame
total_filas = len(Reviews_Completo)

# Calcula la mitad del número total de filas
mitad_filas = total_filas // 2

# Divide el DataFrame en dos partes iguales
Reviews_1 = Reviews_Completo.iloc[:mitad_filas]
Reviews_2 = Reviews_Completo.iloc[mitad_filas:]

# Opcionalmente, reiniciar los índices si es necesario
Reviews_1.reset_index(drop=True, inplace=True)
Reviews_2.reset_index(drop=True, inplace=True)

In [239]:
Reviews_1.to_csv('gold/Reviews_1.csv',index=False)
Reviews_2.to_csv('gold/Reviews_2.csv',index=False)

#### estados

In [2]:
# 'reviews_completo'
Estados = pd.read_csv('silver/Estados.csv')

In [3]:
# Obtén la longitud total del DataFrame
total_filas = len(Estados)

# Calcula la mitad del número total de filas
mitad_filas = total_filas // 2

# Divide el DataFrame en dos partes iguales
Estados_1 = Estados.iloc[:mitad_filas]
Estados_2 = Estados.iloc[mitad_filas:]

# Opcionalmente, reiniciar los índices si es necesario
Estados_1.reset_index(drop=True, inplace=True)
Estados_2.reset_index(drop=True, inplace=True)

In [4]:
Estados_1.to_csv('gold/Estados_1.csv',index=False)
Estados_2.to_csv('gold/Estados_2.csv',index=False)

#### franquicias

In [5]:
# 'reviews_completo'
Franquicias = pd.read_csv('silver/Franquicias_Inversion.csv')

In [6]:
# Obtén la longitud total del DataFrame
total_filas = len(Franquicias)

# Calcula la mitad del número total de filas
mitad_filas = total_filas // 2

# Divide el DataFrame en dos partes iguales
Franquicias_1 = Franquicias.iloc[:mitad_filas]
Franquicias_2 = Franquicias.iloc[mitad_filas:]

# Opcionalmente, reiniciar los índices si es necesario
Franquicias_1.reset_index(drop=True, inplace=True)
Franquicias_2.reset_index(drop=True, inplace=True)

In [7]:
Franquicias_1.to_csv('gold/Franquicias_1.csv',index=False)
Franquicias_2.to_csv('gold/Franquicias_2.csv',index=False)